# Part 1

The file "Purchase_Data.csv" contains purchase data at a Chinese supermarket for various products.  Read this csv into a dataframe called df_data and use the head() method to check that you have read in the data correctly. Make sure you import pandas.

In [3]:
#Write your code here
#Write your code here
import pandas as pd

df_data = pd.read_csv("Purchase_Data.csv")

print(df_data.head())

   invoice_number   invoice_time store_id  product_id  category_id  num_item  \
0    2.020000e+11  7/15/15 10:45     G816     7000300       210101       1.0
1    2.020000e+11  7/15/15 12:16     G816     7070884        70203       1.0
2    2.020000e+11  7/15/15 12:16     G816     7070884        70203       1.0
3    2.020000e+11  7/15/15 12:16     G816     7070891        70401       1.0
4    2.020000e+11  7/15/15 12:16     G816     7090363        70401       1.0

   price
0    2.0
1    2.0
2    2.0
3    6.0
4    6.0

Use the dtypes attribute to view how each column is stored

In [4]:
#Write your code here
#Write your code here
print(df_data.dtypes)

invoice_number    float64
invoice_time       object
store_id           object
product_id          int64
category_id         int64
num_item          float64
price             float64
dtype: object

Slice the first two columns using .loc and store the result in a variable called result_1.

In [9]:
result_1 = df_data.loc[:, :'product_id']

print(result_1)

      invoice_number   invoice_time store_id  product_id
0       2.020000e+11  7/15/15 10:45     G816     7000300
1       2.020000e+11  7/15/15 12:16     G816     7070884
2       2.020000e+11  7/15/15 12:16     G816     7070884
3       2.020000e+11  7/15/15 12:16     G816     7070891
4       2.020000e+11  7/15/15 12:16     G816     7090363
...              ...            ...      ...         ...
5377    2.020000e+11   9/5/15 23:07      300     7308017
5378    2.020000e+11   9/5/15 23:23     G619     7070891
5379    2.020000e+11   9/5/15 23:24     G619     7071096
5380    2.020000e+11   9/5/15 23:32     G619    15000231
5381    2.020000e+11   9/5/15 23:38     G619    23030206

[5382 rows x 4 columns]

Slice the first two rows using .loc and store the result in a variable called result_2.

In [11]:
result_2 = df_data.loc[:1]

print(result_2)

   invoice_number   invoice_time store_id  product_id  category_id  num_item  \
0    2.020000e+11  7/15/15 10:45     G816     7000300       210101       1.0
1    2.020000e+11  7/15/15 12:16     G816     7070884        70203       1.0

   price
0    2.0
1    2.0

Slice the first four rows and the first five columns and store the result in a variable called result_3.

In [12]:
result_3 = df_data.loc[:3, :'product_id']
print(result_3)

   invoice_number   invoice_time store_id  product_id
0    2.020000e+11  7/15/15 10:45     G816     7000300
1    2.020000e+11  7/15/15 12:16     G816     7070884
2    2.020000e+11  7/15/15 12:16     G816     7070884
3    2.020000e+11  7/15/15 12:16     G816     7070891

Slice rows 0,4,6 and columns invoice time and price and store the result in variable called result_4.

In [13]:
#Write your code here
result_4 = df_data.loc[[0, 4, 6], ['invoice_time', 'price']]
print(result_4)

    invoice_time  price
0  7/15/15 10:45    2.0
4  7/15/15 12:16    6.0
6  7/15/15 15:28    2.0

Store the number rows in a variable called num_rows.

In [15]:
num_rows = df_data.shape[0]
print("Number of rows:", num_rows)

Number of rows: 5382

Print out the last row of the data to dataframe. **Hint:** use the variable num_rows from the previous exercise.

In [16]:
#Write your code here
print(df_data.iloc[num_rows - 1])

invoice_number    202000000000.0
invoice_time        9/5/15 23:38
store_id                    G619
product_id              23030206
category_id               210101
num_item                     1.0
price                        2.0
Name: 5381, dtype: object

# Part 2

Compute the average and max price charged.  Store the results in variables called avg_price and max_price

In [17]:
#Write your code here
avg_price = df_data['price'].mean()
max_price = df_data['price'].max()

print("Average price charged:", avg_price)
print("Maximum price charged:", max_price)

Average price charged: 3.1920522110741363
Maximum price charged: 6.01

Compute the average price and average number of items purchased with only a single call to the mean() method. Store these averages in avg_price and avg_num_items.

In [18]:
#Write you code here
avg_price, avg_num_items = df_data[['price', 'num_item']].mean()

print("Average price:", avg_price)
print("Average number of items purchased:", avg_num_items)

Average price: 3.1920522110741363
Average number of items purchased: 1.2983091787439613

Create a column called "total", which is the product of the price and num_item columns.

In [19]:
#Write your code here
df_data['total'] = df_data['price'] * df_data['num_item'] 
print(df_data.head())

   invoice_number   invoice_time store_id  product_id  category_id  num_item  \
0    2.020000e+11  7/15/15 10:45     G816     7000300       210101       1.0
1    2.020000e+11  7/15/15 12:16     G816     7070884        70203       1.0
2    2.020000e+11  7/15/15 12:16     G816     7070884        70203       1.0
3    2.020000e+11  7/15/15 12:16     G816     7070891        70401       1.0
4    2.020000e+11  7/15/15 12:16     G816     7090363        70401       1.0

   price  total
0    2.0    2.0
1    2.0    2.0
2    2.0    2.0
3    6.0    6.0
4    6.0    6.0

What is the avgerage price of the three most expensive purchases?

In [20]:
#Write your code here
avg_top_3_price = df_data.nlargest(3, 'price')['price'].mean()
print("Average price of the three most expensive purchases:", avg_top_3_price)

Average price of the three most expensive purchases: 6.003333333333333

How many different products are there?

In [21]:
#Write your code here
num_unique_products = df_data['product_id'].nunique()
print("Number of different products:", num_unique_products)

Number of different products: 53

Find the difference between the mean and median of the column total.  Use the describe() method and then index the dataframe it returns.

In [22]:
#Write your code here
summary_stats = df_data.describe()
difference_mean_median = summary_stats.loc['mean', 'total'] - summary_stats.loc['50%', 'total']

print("Difference between mean and median of 'total' column:", difference_mean_median)

Difference between mean and median of 'total' column: 0.9318078781127839

Use the drop() method to delete the column total from the dataframe df_data.

In [23]:
#Write your code here
df_data = df_data.drop(columns=['total'])
print(df_data)

      invoice_number   invoice_time store_id  product_id  category_id  \
0       2.020000e+11  7/15/15 10:45     G816     7000300       210101
1       2.020000e+11  7/15/15 12:16     G816     7070884        70203
2       2.020000e+11  7/15/15 12:16     G816     7070884        70203
3       2.020000e+11  7/15/15 12:16     G816     7070891        70401
4       2.020000e+11  7/15/15 12:16     G816     7090363        70401
...              ...            ...      ...         ...          ...
5377    2.020000e+11   9/5/15 23:07      300     7308017       210101
5378    2.020000e+11   9/5/15 23:23     G619     7070891        70401
5379    2.020000e+11   9/5/15 23:24     G619     7071096        70201
5380    2.020000e+11   9/5/15 23:32     G619    15000231        70301
5381    2.020000e+11   9/5/15 23:38     G619    23030206       210101

      num_item  price
0          1.0    2.0
1          1.0    2.0
2          1.0    2.0
3          1.0    6.0
4          1.0    6.0
...        ...    ...
5377       1.0    3.0
5378       1.0    6.0
5379       1.0    5.0
5380       2.0    2.0
5381       1.0    2.0

[5382 rows x 7 columns]

Let's dig a little deeper into the data set and answer some basic question.

In [1]:
#Write your code here

First, covert the column invoice time to a datetime column. Print out the new column types to make sure this was done correctly

In [24]:
#Write your code here
df_data['invoice_time'] = pd.to_datetime(df_data['invoice_time'])

print(df_data.dtypes)

invoice_number           float64
invoice_time      datetime64[ns]
store_id                  object
product_id                 int64
category_id                int64
num_item                 float64
price                    float64
dtype: object

Next, let's create columns called "DOW" and "Month", which store the corresponding weekday and month of the invoice respectively.  Print the head of the dataframe to make sure this was done correctly.

In [25]:
#Write your code here
df_data['DOW'] = df_data['invoice_time'].dt.day_name()
df_data['Month'] = df_data['invoice_time'].dt.month_name()

print(df_data.head())

   invoice_number        invoice_time store_id  product_id  category_id  \
0    2.020000e+11 2015-07-15 10:45:00     G816     7000300       210101
1    2.020000e+11 2015-07-15 12:16:00     G816     7070884        70203
2    2.020000e+11 2015-07-15 12:16:00     G816     7070884        70203
3    2.020000e+11 2015-07-15 12:16:00     G816     7070891        70401
4    2.020000e+11 2015-07-15 12:16:00     G816     7090363        70401

   num_item  price        DOW Month
0       1.0    2.0  Wednesday  July
1       1.0    2.0  Wednesday  July
2       1.0    2.0  Wednesday  July
3       1.0    6.0  Wednesday  July
4       1.0    6.0  Wednesday  July

Create a variable called num_purchases_wed, which stores the number of purchases made on Wednesday?  You should use value_counts and then index the series it return.

In [26]:
#Write your code here
day_counts = df_data['DOW'].value_counts()
num_purchases_wed = day_counts.get('Wednesday', 0)

print("Number of purchases made on Wednesday:", num_purchases_wed)

Number of purchases made on Wednesday: 959

# Part 3

In this set of practice exercises, we will be working with a demographic data regarding the passengers aboard the Titanic.  Read in the data frame and use the head() method to check that it was read in correctly.

In [27]:
#Write your code here
import pandas as pd
df_titanic = pd.read_csv('Titanic.csv')  

print(df_titanic.head())

   PassengerId  Pclass                                          Name     Sex  \
0          892       3                              Kelly, Mr. James    male
1          893       3              Wilkes, Mrs. James (Ellen Needs)  female
2          894       2                     Myles, Mr. Thomas Francis    male
3          895       3                              Wirz, Mr. Albert    male
4          896       3  Hirvonen, Mrs. Alexander (Helga E Lindqvist)  female

    Age  SibSp  Parch   Ticket     Fare Cabin Embarked
0  34.5      0      0   330911   7.8292   NaN        Q
1  47.0      1      0   363272   7.0000   NaN        S
2  62.0      0      0   240276   9.6875   NaN        Q
3  27.0      0      0   315154   8.6625   NaN        S
4  22.0      1      1  3101298  12.2875   NaN        S

Use the rename method to change the column "Name" to "Passenger_Name" and the column "Ticket" to "Ticket_Num".

In [28]:
#Write your code here
df_titanic = df_titanic.rename(columns={'Name': 'Passenger_Name', 'Ticket': 'Ticket_Num'})

print(df_titanic)

     PassengerId  Pclass                                Passenger_Name  \
0            892       3                              Kelly, Mr. James
1            893       3              Wilkes, Mrs. James (Ellen Needs)
2            894       2                     Myles, Mr. Thomas Francis
3            895       3                              Wirz, Mr. Albert
4            896       3  Hirvonen, Mrs. Alexander (Helga E Lindqvist)
..           ...     ...                                           ...
413         1305       3                            Spector, Mr. Woolf
414         1306       1                  Oliva y Ocana, Dona. Fermina
415         1307       3                  Saether, Mr. Simon Sivertsen
416         1308       3                           Ware, Mr. Frederick
417         1309       3                      Peter, Master. Michael J

        Sex   Age  SibSp  Parch          Ticket_Num      Fare Cabin Embarked
0      male  34.5      0      0              330911    7.8292   NaN        Q
1    female  47.0      1      0              363272    7.0000   NaN        S
2      male  62.0      0      0              240276    9.6875   NaN        Q
3      male  27.0      0      0              315154    8.6625   NaN        S
4    female  22.0      1      1             3101298   12.2875   NaN        S
..      ...   ...    ...    ...                 ...       ...   ...      ...
413    male   NaN      0      0           A.5. 3236    8.0500   NaN        S
414  female  39.0      0      0            PC 17758  108.9000  C105        C
415    male  38.5      0      0  SOTON/O.Q. 3101262    7.2500   NaN        S
416    male   NaN      0      0              359309    8.0500   NaN        S
417    male   NaN      1      1                2668   22.3583   NaN        C

[418 rows x 11 columns]

Change the index of the df_titanic to the column PasengerID.

In [29]:
#Write your code here
df_titanic = df_titanic.set_index('PassengerId')

print(df_titanic)

             Pclass                                Passenger_Name     Sex  \
PassengerId
892               3                              Kelly, Mr. James    male
893               3              Wilkes, Mrs. James (Ellen Needs)  female
894               2                     Myles, Mr. Thomas Francis    male
895               3                              Wirz, Mr. Albert    male
896               3  Hirvonen, Mrs. Alexander (Helga E Lindqvist)  female
...             ...                                           ...     ...
1305              3                            Spector, Mr. Woolf    male
1306              1                  Oliva y Ocana, Dona. Fermina  female
1307              3                  Saether, Mr. Simon Sivertsen    male
1308              3                           Ware, Mr. Frederick    male
1309              3                      Peter, Master. Michael J    male

              Age  SibSp  Parch          Ticket_Num      Fare Cabin Embarked
PassengerId
892          34.5      0      0              330911    7.8292   NaN        Q
893          47.0      1      0              363272    7.0000   NaN        S
894          62.0      0      0              240276    9.6875   NaN        Q
895          27.0      0      0              315154    8.6625   NaN        S
896          22.0      1      1             3101298   12.2875   NaN        S
...           ...    ...    ...                 ...       ...   ...      ...
1305          NaN      0      0           A.5. 3236    8.0500   NaN        S
1306         39.0      0      0            PC 17758  108.9000  C105        C
1307         38.5      0      0  SOTON/O.Q. 3101262    7.2500   NaN        S
1308          NaN      0      0              359309    8.0500   NaN        S
1309          NaN      1      1                2668   22.3583   NaN        C

[418 rows x 10 columns]

Select the name of passenger 896

In [30]:
#Write your code here
passenger_name_896 = df_titanic.loc[896, 'Passenger_Name']

print("Name of passenger with PassengerId 896:", passenger_name_896)

Name of passenger with PassengerId 896: Hirvonen, Mrs. Alexander (Helga E Lindqvist)

Change the index back to row numbers but making sure that we don't lose the PassengerId column.

In [31]:
#Write your code here
df_titanic = df_titanic.reset_index(drop=False)

print(df_titanic)

     PassengerId  Pclass                                Passenger_Name  \
0            892       3                              Kelly, Mr. James
1            893       3              Wilkes, Mrs. James (Ellen Needs)
2            894       2                     Myles, Mr. Thomas Francis
3            895       3                              Wirz, Mr. Albert
4            896       3  Hirvonen, Mrs. Alexander (Helga E Lindqvist)
..           ...     ...                                           ...
413         1305       3                            Spector, Mr. Woolf
414         1306       1                  Oliva y Ocana, Dona. Fermina
415         1307       3                  Saether, Mr. Simon Sivertsen
416         1308       3                           Ware, Mr. Frederick
417         1309       3                      Peter, Master. Michael J

        Sex   Age  SibSp  Parch          Ticket_Num      Fare Cabin Embarked
0      male  34.5      0      0              330911    7.8292   NaN        Q
1    female  47.0      1      0              363272    7.0000   NaN        S
2      male  62.0      0      0              240276    9.6875   NaN        Q
3      male  27.0      0      0              315154    8.6625   NaN        S
4    female  22.0      1      1             3101298   12.2875   NaN        S
..      ...   ...    ...    ...                 ...       ...   ...      ...
413    male   NaN      0      0           A.5. 3236    8.0500   NaN        S
414  female  39.0      0      0            PC 17758  108.9000  C105        C
415    male  38.5      0      0  SOTON/O.Q. 3101262    7.2500   NaN        S
416    male   NaN      0      0              359309    8.0500   NaN        S
417    male   NaN      1      1                2668   22.3583   NaN        C

[418 rows x 11 columns]

How many missing entries are there in the Age column? Use the isnull() method and recall than Booleans are exactly like 1s (True) and 0s (False).

In [32]:
#Write you code here
missing_entries_age = df_titanic['Age'].isnull().sum()

print("Number of missing entries in the 'Age' column:", missing_entries_age)

Number of missing entries in the 'Age' column: 86

Compute the avg age of passengers ignoring the missing data.

In [33]:
#Write your code here
avg_age = df_titanic['Age'].dropna().mean()

print(f"The Average age of passengers (ignoring missing data): {avg_age}")

The Average age of passengers (ignoring missing data): 30.272590361445783

Using the fillna() method replace the missing values in the Age column with the mean.

In [34]:
#Write your code here
mean_age = df_titanic['Age'].mean()
df_titanic['Age'] = df_titanic['Age'].fillna(mean_age)

print(df_titanic)

     PassengerId  Pclass                                Passenger_Name  \
0            892       3                              Kelly, Mr. James
1            893       3              Wilkes, Mrs. James (Ellen Needs)
2            894       2                     Myles, Mr. Thomas Francis
3            895       3                              Wirz, Mr. Albert
4            896       3  Hirvonen, Mrs. Alexander (Helga E Lindqvist)
..           ...     ...                                           ...
413         1305       3                            Spector, Mr. Woolf
414         1306       1                  Oliva y Ocana, Dona. Fermina
415         1307       3                  Saether, Mr. Simon Sivertsen
416         1308       3                           Ware, Mr. Frederick
417         1309       3                      Peter, Master. Michael J

        Sex       Age  SibSp  Parch          Ticket_Num      Fare Cabin  \
0      male  34.50000      0      0              330911    7.8292   NaN
1    female  47.00000      1      0              363272    7.0000   NaN
2      male  62.00000      0      0              240276    9.6875   NaN
3      male  27.00000      0      0              315154    8.6625   NaN
4    female  22.00000      1      1             3101298   12.2875   NaN
..      ...       ...    ...    ...                 ...       ...   ...
413    male  30.27259      0      0           A.5. 3236    8.0500   NaN
414  female  39.00000      0      0            PC 17758  108.9000  C105
415    male  38.50000      0      0  SOTON/O.Q. 3101262    7.2500   NaN
416    male  30.27259      0      0              359309    8.0500   NaN
417    male  30.27259      1      1                2668   22.3583   NaN

    Embarked
0          Q
1          S
2          Q
3          S
4          S
..       ...
413        S
414        C
415        S
416        S
417        C

[418 rows x 11 columns]

What is the average age of the 5 oldest passengers? The reset_index method will be helpful here.

In [35]:
#Write your code here
sorted_df = df_titanic.sort_values(by='Age', ascending=False)
sorted_df = sorted_df.reset_index(drop=True)
avg_age_oldest = sorted_df.head(5)['Age'].mean()

print("Average age of the 5 oldest passengers:", avg_age_oldest)

Average age of the 5 oldest passengers: 67.0